In [228]:
# Dependencies
import pandas as pd
import numpy as np

In [229]:
# Save path to data set in a variable
data_file = "C:\\Users\\taiwo\\OneDrive\\Desktop\\PREWORK_TO\\Module 4\\Resources\\purchase_data.csv"

In [230]:
# Use Pandas to read data
data_file_pd = pd.read_csv(data_file)
data_file_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [231]:
# Display a statistical overview of the DataFrame
data_file_pd.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [232]:
# The total number of players
count_players = data_file_pd["SN"].nunique()
count_players

576

In [233]:
# The total number of unique items
unique_items = data_file_pd["Item ID"].nunique()
unique_items

183

In [234]:
# The average purchase price
average_price = data_file_pd["Price"].mean()
average_price

3.050987179487176

In [235]:
# The total number of purchases
no_items = data_file_pd["SN"].count()
no_items

780

In [236]:
# Total Revenue
revenue = data_file_pd["Price"].sum()
revenue

2379.77

In [237]:
Quick_Summary = pd.DataFrame(
    {"Total_No_Of_Players": (count_players),
     "Unique_Items": (unique_items),
     "Average_Price": (average_price),
     "Total_No_Of_Purchases": (no_items),
     "Total_Revenue": [revenue]})

Quick_Summary

,Total_No_Of_Players,Unique_Items,Average_Price,Total_No_Of_Purchases,Total_Revenue
0,576,183,3.050987,780,2379.77

In [238]:
# Count By Gender
count_by_gender = data_file_pd["Gender"].value_counts()
count_by_gender

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [239]:
# Percentage by gender
Percentage_by_gender = data_file_pd["Gender"].value_counts(max)*100
Percentage_by_gender.round(2)

Male                     83.59
Female                   14.49
Other / Non-Disclosed     1.92
Name: Gender, dtype: float64

In [240]:
# Display Table
Display_Table = pd.DataFrame(
    {"Total Count": count_by_gender,
     "Percentage of Players": Percentage_by_gender.round(2),
     })

Display_Table

                       Total Count  Percentage of Players
Male                           652                  83.59
Female                         113                  14.49
Other / Non-Disclosed           15                   1.92

In [241]:
# Using GroupBy in order to separate the data into fields according to "Gender" values
grouped_gender_df = data_file_pd.groupby(['Gender'])

# The object returned is a "GroupBy" object and cannot be viewed normally...
print(grouped_gender_df)

# In order to be visualized, a data function must be used...
#grouped_gender_df.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000020642736278>

In [242]:
#Average Purchase Price per Gender
Average_purchase_price = grouped_gender_df[["Price"]].mean().round(2)
Average_purchase_price

                       Price
Gender
Female                  3.20
Male                    3.02
Other / Non-Disclosed   3.35

In [243]:
#Total Purchase Value per Gender
Total_purchase_value = grouped_gender_df[["Price"]].sum()
Total_purchase_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [244]:
#Total Purchase Count per Gender
Purchase_count = grouped_gender_df[["Price"]].count()
Purchase_count

                       Price
Gender
Female                   113
Male                     652
Other / Non-Disclosed     15

In [245]:
#Unique Persons by Gender
UPG = grouped_gender_df[["SN"]].nunique()
UPG

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [246]:
#Average Purchase Total per Person by Gender
APG1 = Total_purchase_value.values / UPG.values
APG1 = pd.DataFrame(APG1, index=Total_purchase_value.index).round(2)
APG1

                          0
Gender
Female                 4.47
Male                   4.07
Other / Non-Disclosed  4.56

In [247]:
#Summary TableI - PURCHALE ANALYSIS BY GENDER

Summary_Table1 = pd.DataFrame(
    {"Purchase Count": Purchase_count['Price'],
     "Average Purchase Price per Gender": Average_purchase_price['Price'],
     "Total Purchase Value per Gender": Total_purchase_value['Price'] ,
     "Unique Persons per Gender": UPG['SN'],
    "Average Purchase Total per Person by Gender": APG1[0]
     })

Summary_Table1

,Purchase Count,Average Purchase Price per Gender,Total Purchase Value per Gender,Unique Persons per Gender,Average Purchase Total per Person by Gender
Gender,,,,,
Female,113,3.20,361.94,81,4.47
Male,652,3.02,1967.64,484,4.07
Other / Non-Disclosed,15,3.35,50.19,11,4.56

In [248]:
# Create bins in which to place values based upon age groups of players
bins = [0, 10, 15, 20, 25, 30, 35, 40, 50]

# Create labels for these bins
group_labels = ["0 to 10", "11 to 15", "16 to 20" , "21 to 25" , "26 to 30" , "31 to 35" , "36 to 40" ,
                "41 to 50"]
# Slice the data and place it into bins
pd.cut(data_file_pd["Age"], bins, labels=group_labels).head()

0    16 to 20
1    36 to 40
2    21 to 25
3    21 to 25
4    21 to 25
Name: Age, dtype: category
Categories (8, object): [0 to 10 < 11 to 15 < 16 to 20 < 21 to 25 < 26 to 30 < 31 to 35 < 36 to 40 < 41 to 50]

In [249]:
# Place the data series into a new column inside of the DataFrame
data_file_pd["Age Group"] = pd.cut(data_file_pd["Age"], bins, labels=group_labels)
data_file_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,16 to 20
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,36 to 40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,21 to 25
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,21 to 25
4,4,Iskosia90,23,Male,131,Fury,1.44,21 to 25

In [250]:
# Create a GroupBy object based upon "Age Group"
Pymoli_group = data_file_pd.groupby("Age Group")

# Purchase Count per Bin
Pymoli_group_count = (Pymoli_group["Item ID"].count())
Pymoli_group_count

Age Group
0 to 10      32
11 to 15     54
16 to 20    200
21 to 25    325
26 to 30     77
31 to 35     52
36 to 40     33
41 to 50      7
Name: Item ID, dtype: int64

In [251]:
#Percentage Count of players per Age Group
Pymoli_group_percentage = ((Pymoli_group.count()['Price'])*0.128205).round(2)
Pymoli_group_percentage

Age Group
0 to 10      4.10
11 to 15     6.92
16 to 20    25.64
21 to 25    41.67
26 to 30     9.87
31 to 35     6.67
36 to 40     4.23
41 to 50     0.90
Name: Price, dtype: float64

In [252]:
#Summary TableII - AGE DEMOGRAPHICS
Summary_TableII = pd.DataFrame(
    {"Total Count": Pymoli_group_count,
     "Percentage of Players": Pymoli_group_percentage,
     })

Summary_TableII

           Total Count  Percentage of Players
Age Group
0 to 10             32                   4.10
11 to 15            54                   6.92
16 to 20           200                  25.64
21 to 25           325                  41.67
26 to 30            77                   9.87
31 to 35            52                   6.67
36 to 40            33                   4.23
41 to 50             7                   0.90

In [253]:
# Average Purchase Price per Bin
Pymoli_group_mean = Pymoli_group[["Price"]].mean().round(2)
Pymoli_group_mean

           Price
Age Group
0 to 10     3.40
11 to 15    2.90
16 to 20    3.11
21 to 25    3.02
26 to 30    2.88
31 to 35    2.99
36 to 40    3.40
41 to 50    3.08

In [254]:
# Total Purchase Price per Bin
Pymoli_group_sum = Pymoli_group[["Price"]].sum()
Pymoli_group_sum

            Price
Age Group
0 to 10    108.96
11 to 15   156.60
16 to 20   621.56
21 to 25   981.64
26 to 30   221.42
31 to 35   155.71
36 to 40   112.35
41 to 50    21.53

In [255]:
# Purchase Count per person per Bin
Pymoli_group_upcount = (Pymoli_group["SN"].nunique())
Pymoli_group_upcount

Age Group
0 to 10      24
11 to 15     41
16 to 20    150
21 to 25    232
26 to 30     59
31 to 35     37
36 to 40     26
41 to 50      7
Name: SN, dtype: int64

In [256]:
#Average Purchase Total per Person by Age Group/Bin
APG = Pymoli_group_sum.values / Pymoli_group_upcount.values
APG = pd.DataFrame(APG, index=Pymoli_group_sum.index) 
APG = pd.DataFrame(APG [[0]]).round(2)
APG

               0
Age Group
0 to 10     4.54
11 to 15    6.53
16 to 20   25.90
21 to 25   40.90
26 to 30    9.23
31 to 35    6.49
36 to 40    4.68
41 to 50    0.90

In [257]:
# Quick_Summary1 = pd.DataFrame(Quick_Summary1, new_index='Age Group'.index)
Quick_Summary1 = pd.DataFrame(
    {"Average Purchase Price per Bin": Pymoli_group_mean['Price'],
     "Total Purchase Price per Bin": Pymoli_group_sum['Price'],
     "Purchase Count per person per Bin": Pymoli_group_upcount,
    "Average Purchase Total per Person by Age Group/Bin": APG[0]
     })

Quick_Summary1

,Average Purchase Price per Bin,Total Purchase Price per Bin,Purchase Count per person per Bin,Average Purchase Total per Person by Age Group/Bin
Age Group,,,,
0 to 10,3.40,108.96,24,4.54
11 to 15,2.90,156.60,41,6.53
16 to 20,3.11,621.56,150,25.90
21 to 25,3.02,981.64,232,40.90
26 to 30,2.88,221.42,59,9.23
31 to 35,2.99,155.71,37,6.49
36 to 40,3.40,112.35,26,4.68
41 to 50,3.08,21.53,7,0.90

In [258]:
#Top 5 Spenders
# Using GroupBy in order to separate the data into fields according to "SN" values
grouped_SN_df = data_file_pd.groupby(['SN'])

# The object returned is a "GroupBy" object and cannot be viewed normally...
print(grouped_SN_df)

# In order to be visualized, a data function must be used...
group_SN = grouped_SN_df.sum()
group_SN = group_SN[["Price"]]
group_SN = group_SN.sort_values(by=["Price"], ascending=False).head(5)
group_SN

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000206427369E8>

             Price
SN
Lisosia93    18.96
Idastidru52  15.45
Chamjask73   13.83
Iral74       13.62
Iskadarya95  13.10

In [259]:
group_SN = grouped_SN_df.count()
group_SN = group_SN[["Price"]]
group_SN1= group_SN.sort_values(by=["Price"], ascending=False).head(5)
group_SN1

             Price
SN
Lisosia93        5
Iral74           4
Idastidru52      4
Asur53           3
Inguron55        3

In [260]:
# Top Spenders: Merge, Reference and Rename columns

merged_df = pd.merge(grouped_SN_df.sum(), grouped_SN_df.count(), on="SN")
merged_df = merged_df.sort_values(by=["Price_x"], ascending=False).head(5)
Quick_SummaryII = merged_df[["Price_x", "Price_y"]]
Quick_SummaryII = Quick_SummaryII.rename(columns={"Price_X":"Total Purchase Value", "Price_y":"Purchase Count"})
Quick_SummaryII

             Price_x  Purchase Count
SN
Lisosia93      18.96               5
Idastidru52    15.45               4
Chamjask73     13.83               3
Iral74         13.62               4
Iskadarya95    13.10               3

In [261]:
Average_Purchase_Price = grouped_SN_df.mean().round(2)
# Merge the two created data frames for the Top Spenders
merged_df2 = pd.merge(Quick_SummaryII, Average_Purchase_Price , on="SN")
merged_df2 = merged_df2[["Price_x", "Purchase Count", "Price"]]
merged_df2 = merged_df2.rename(columns={"Price_X":"Total Purchase Value", "Price":"Average Purchase Price"})
merged_df2

             Price_x  Purchase Count  Average Purchase Price
SN
Lisosia93      18.96               5                    3.79
Idastidru52    15.45               4                    3.86
Chamjask73     13.83               3                    4.61
Iral74         13.62               4                    3.40
Iskadarya95    13.10               3                    4.37

In [262]:
# Most Popular Items
# Using GroupBy in order to separate the data into fields according to "Item ID" values
grouped_ItemID_df = data_file_pd.groupby(['Item ID','Item Name'])

# The object returned is a "GroupBy" object and cannot be viewed normally...
print(grouped_ItemID_df)

# In order to be visualized, a data function must be used...
group_Item = grouped_ItemID_df.count()
group_Item = group_Item[["Price"]]
group_Item.sort_values(by=["Price"], ascending=False).head(5)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002064275E438>

                                                      Price
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm     12
145     Fiery Glass Crusader                              9
108     Extraction, Quickblade Of Trembling Hands         9
82      Nirvana                                           9
19      Pursuit, Cudgel of Necromancy                     8

In [263]:
merged_df = pd.merge(grouped_ItemID_df.count(), grouped_ItemID_df.sum(), on="Item Name")
merged_df = merged_df.sort_values(by=["Price_x"], ascending=False).head(5)
Quick_SummaryIII = merged_df[["Price_x", "Price_y"]]
Quick_SummaryIII = Quick_SummaryIII.rename(columns={"Price_X":"Purchase Count", "Price_y":"Total Purchase Value"})
Quick_SummaryIII

                                              Price_x  Total Purchase Value
Item Name
Oathbreaker, Last Hope of the Breaking Storm       12                 50.76
Nirvana                                             9                 44.10
Extraction, Quickblade Of Trembling Hands           9                 31.77
Fiery Glass Crusader                                9                 41.22
Winter's Bite                                       8                 30.16

In [264]:
# Most Profitable Items
# Using GroupBy in order to separate the data into fields according to "Item ID" values
grouped_ItemID_df = data_file_pd.groupby(['Item ID','Item Name'])

# The object returned is a "GroupBy" object and cannot be viewed normally...
print(grouped_ItemID_df)

# In order to be visualized, a data function must be used...
group_Itemp = grouped_ItemID_df.sum()
group_Itemp = group_Itemp[["Price"]]
group_Itemp.sort_values(by=["Price"], ascending=False).head(5)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002064275EEB8>

                                                      Price
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm  50.76
82      Nirvana                                       44.10
145     Fiery Glass Crusader                          41.22
92      Final Critic                                  39.04
103     Singed Scalpel                                34.80

In [265]:
merged_df = pd.merge(grouped_ItemID_df.count(), grouped_ItemID_df.sum(), on="Item Name")
merged_df = merged_df.sort_values(by=["Price_y"], ascending=False).head(5)
Quick_SummaryIV = merged_df[["Price_y", "Price_x"]]
Quick_SummaryIV = Quick_SummaryIV.rename(columns={"Price_y":"Total Purchase Value", "Price_X":"Purchase Count"})
Quick_SummaryIV

                                              Total Purchase Value  Price_x
Item Name
Oathbreaker, Last Hope of the Breaking Storm                 50.76       12
Nirvana                                                      44.10        9
Fiery Glass Crusader                                         41.22        9
Final Critic                                                 39.04        5
Final Critic                                                 39.04        8

In [267]:
#OBSERVABLE TRENDS
#1. Game Item 178 (Oathbreaker, Last Hope of the Breaking Storm) is both most popular and most profitable item
#2. Player with Screen Name 'Lisosia93' is the top spender
#3. Bin 21yrs - 25yrs age group had the highest purchase price